- ## Hafta 3 Ödev

In [1]:
import numpy as numpy
import pandas as pd

- Verisetini pandas ile okuma

In [2]:
df = pd.read_csv("Titanic_dataset.csv")
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [3]:
df.shape

(891, 12)

In [4]:
df.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [8]:
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [9]:
df.select_dtypes(include='object').nunique()

Name        891
Sex           2
Ticket      681
Cabin       147
Embarked      3
dtype: int64

- Eksik veri kontrolü

In [7]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

- Kazada ölenlerin yaş ortalaması

In [29]:
mean_age_dead = float(round(df[(df['Survived'] == 0) & (df['Age'].notnull())]['Age'].mean(), 2))
mean_age_dead

30.63

- Kazada ölenlerin bilet fiyatlarının ortalamasını ve medyanı

In [26]:
mean_fare_dead = float(round(df[(df['Survived'] == 0) & (df['Fare'].notnull())]['Fare'].mean(), 2))
median_fare_dead = float(round(df[(df['Survived'] == 0) & (df['Fare'].notnull())]['Fare'].median(), 2))

In [27]:
mean_fare_dead

22.12

In [28]:
median_fare_dead

10.5

- Kazada ölen erkeklerin yaş ortalaması

In [25]:
mean_age_dead_males = float(round(df[(df['Survived'] == 0) & (df['Sex'] == 'male') & (df['Age'].notnull())]['Age'].mean(), 2))
mean_age_dead_males

31.62

- Kazada ölen Kadınların yaş ortalaması

In [24]:
mean_age_dead_females = float(round(df[(df['Survived'] == 0) & (df['Sex'] == 'female') & (df['Age'].notnull())]['Age'].mean(), 2))
mean_age_dead_females

25.05

- Kazadan kurtulanların yaş ortalaması

In [22]:
mean_age_survived = float(round(df[(df['Survived'] == 1) & (df['Age'].notnull())]['Age'].mean(), 2))
mean_age_survived

28.34

- Kazadan kurtulanların bilet fiyatlarının ortalaması

In [23]:
mean_fare_survived = float(round(df[(df['Survived'] == 1) & (df['Fare'].notnull())]['Fare'].mean(), 2))
mean_fare_survived

48.4

- Kazadan kurtulan toplam kişi sayısı

In [30]:
len(df[df['Survived'] == 1])

342

- 10 yaşından küçüklerin bilet fiyatlarının medyan değeri

In [31]:
median_fare_under_10 = float(round(df[(df['Age'] < 10) & (df['Fare'].notnull())]['Fare'].median(), 2))
median_fare_under_10

27.0

- 1.sınıf, 2.sınıf ve 3.sınıf bilet fiyatlarının ortalama ve medyanlarını karşılaştırılması

In [34]:
fare_stats_by_class = df[df['Fare'].notnull()].groupby('Pclass')['Fare'].agg(['mean', 'median']).round(2)
fare_stats_by_class

         mean  median
Pclass
1       84.15   60.29
2       20.66   14.25
3       13.68    8.05

- Kazada ölen kadınların oranı ile erkeklerin oranının karşılaştırılması

In [40]:
# Toplam kadın ve erkek sayısı
total_females = len(df[df['Sex'] == 'female'])
total_males = len(df[df['Sex'] == 'male'])

# Ölen kadın ve erkek sayısı
dead_females = len(df[(df['Sex'] == 'female') & (df['Survived'] == 0)])
dead_males = len(df[(df['Sex'] == 'male') & (df['Survived'] == 0)])

# Kazada ölenlerin oranı
female_death_rate = round(dead_females / total_females, 2)
male_death_rate = round(dead_males / total_males, 2)

In [43]:
total_females

314

In [44]:
total_males

577

In [45]:
dead_females

81

In [46]:
dead_males

468

In [47]:
female_death_rate

0.26

In [48]:
male_death_rate

0.81